<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
                    {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                    {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])

In [3]:
df.head()

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [4]:
df['salary'] = 0 #새로운 열 생성

In [5]:
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [6]:
import numpy as np # numpy 이용

In [9]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no') # job에서 student가 아니면 연봉o

In [10]:
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [11]:
friend_dict_list = [{'name': 'Jone', 'midterm': 95, 'final': 85},
                    {'name': 'Jenny', 'midterm': 85, 'final': 80},
                    {'name': 'Nate', 'midterm': 30, 'final': 10}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [12]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [13]:
df['total'] = df['midterm'] + df['final'] # 총점 추가

In [14]:
df.head()

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [15]:
df['average'] = df['total'] / 2 # 평균 추가

In [16]:
df.head()

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [18]:
grades = []

for row in df['average']:
  if row>=90:
    grades.append('A')
  elif row>=80:
    grades.append('B')
  else:
    grades.append('F') 

df['grade'] = grades # 성적 추가(grades라는 list 사용)

In [19]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [20]:
def pass_or_fail(row):
  if row != 'F':
    return "Pass"
  else:
    return "Fail" # pass, fail로 변경하기(pass_or_fail 정의)

In [21]:
df.grade = df.grade.apply(pass_or_fail) # apply 사용

In [22]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [23]:
date_list = [
             {
                 'yyyy-mm-dd' : '2000-06-27'
             },
             {
                 'yyyy-mm-dd' : '2000-10-27'
             }
]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [24]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2000-10-27

In [25]:
def extract_year(row):
  return row.split('-')[0] # 연도만 따로 빼기(extract_year이라는 함수 정의)

In [26]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year) #apply이용해서 연도만 따로 빼기

In [27]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2000-10-27  2000

In [28]:
friend_dict_list = [{'name': 'Jone', 'midterm': 95, 'final': 85},
                    {'name': 'Jenny', 'midterm': 85, 'final': 80},
                    {'name': 'Nate', 'midterm': 30, 'final': 10}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [29]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [30]:
df2 = pd.DataFrame([
                    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final']) # 행 생성하기

In [31]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [32]:
df.append(df2, ignore_index = True)# 새로운 데이터프레임과 기존의 데이터프레임 합치기

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50